tylertms/dspic33e-sim/conformance/nvm.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "device.h"
#include "dspic33.h"
#include "elf_image.h"
#include "hex_image.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} NvmConformance;

enum {
    NVM_CONTROL = 0x0728u,
    NVM_ADDRESS = 0x072au,
    NVM_ADDRESS_HIGH = 0x072cu,
    NVM_KEY = 0x072eu,
    MAIN_CLOCK_DIVISOR = 0x0744u,
    NVM_WRITE = 0x8000u,
    NVM_WRITE_ENABLE = 0x4000u,
    NVM_WRITE_ERROR = 0x2000u,
    NVM_IRQ = 15u,
    NVM_SEQUENCE_BASE = 0x0400u,
    PERSISTENT_PROGRAM_TAG = 0x01000000u,
    PERSISTENT_PROGRAM_BASE = 0x2000u,
    PERSISTENT_PROGRAM_LIMIT = 0x5000u,
    MOVE_KEY_55 = 0x200550u,
    MOVE_KEY_AA = 0x200aa0u,
    WRITE_NVM_KEY = 0x883970u,
    SET_NVM_WRITE = 0xa8e729u,
    TBLRDL_W2_W3 = 0xba0192u,
    TBLRDL_BYTE_W2_W3 = 0xba4192u,
    TBLRDH_W2_W3 = 0xba8192u,
    TBLRDH_BYTE_W2_W3 = 0xbac192u,
    OPCODE_NOP = 0x000000u,
    OPCODE_RESET = 0xfe0000u,
    OPCODE_RETFIE = 0x064000u,
    OPCODE_MOV_LITERAL_0X1234_W2 = 0x212342u,
    OPCODE_MOV_W1_W2 = 0x780111u,
    OPCODE_BTSC_W2_BIT_0 = 0xa70002u,
    OPCODE_DO_1 = 0x080001u,
    OPCODE_GOTO_0X100 = 0x040100u
};

static void expect(NvmConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[nvm-failed] %s\n", name);
    }
}

static bool interrupt_flag(Dspic33* cpu) {
    return (dspic33_read_word(cpu, 0x0800u) & 0x8000u) != 0u;
}

static uint32_t program_word(const Dspic33* cpu, uint32_t address) {
    return dspic33_read_program_word(cpu, address);
}

static void configure_operation(Dspic33* cpu, uint16_t operation, uint32_t address,
                                bool write_enable) {
    dspic33_write_word(cpu, NVM_ADDRESS, (uint16_t)address);
    dspic33_write_word(cpu, NVM_ADDRESS_HIGH, (uint16_t)(address >> 16u));
    dspic33_write_word(cpu, NVM_CONTROL,
                       (uint16_t)(operation | (write_enable ? NVM_WRITE_ENABLE : 0u)));
}

static bool step_instructions(Dspic33* cpu, uint8_t count) {
    uint8_t index;
    for (index = 0u; index < count; index++) {
        if (dspic33_step(cpu) != DSPIC33_RUNNING) {
            return false;
        }
    }
    return true;
}

static bool read_table(Dspic33* cpu, uint32_t address, uint32_t opcode,
                       uint16_t* value) {
    dspic33_reset(cpu, 0u);
    if (!dspic33_load_program_word(cpu, 0u, opcode)) {
        return false;
    }
    cpu->tblpag = (uint16_t)(address >> 16u);
    dspic33_set_working_register(cpu, 2u, (uint16_t)address);
    dspic33_set_working_register(cpu, 3u, 0xa5a5u);
    if (dspic33_step(cpu) != DSPIC33_RUNNING) {
        return false;
    }
    *value = cpu->w[3];
    return true;
}

static void configuration_table_view_cases(NvmConformance* state, Dspic33* cpu) {
    static const uint32_t addresses[] = {0xf80004u, 0xf80006u, 0xf80008u, 0xf8000au,
                                         0xf8000cu, 0xf8000eu, 0xf80010u, 0xf80012u};
    static const uint8_t defaults[] = {0xcfu, 0xffu, 0xffu, 0xffu,
                                       0xffu, 0xdfu, 0xcfu, 0xffu};
    static const uint16_t loaded[] = {0xa511u, 0xb622u, 0xc733u, 0xd844u,
                                      0xe955u, 0xfa66u, 0x8b77u, 0x9c88u};
    static const uint32_t ids[] = {0xff0000u, 0xff0002u};
    static const uint16_t id_values[] = {0x1872u, 0x4002u};
    static const uint32_t reserved[] = {0xf80000u, 0xf80002u};
    uint16_t value;
    size_t index;
    Dspic33 copy;
    bool copy_initialized;

    for (index = 0u; index < sizeof(addresses) / sizeof(addresses[0]); index++) {
        uint32_t address = addresses[index];
        expect(state,
               dspic33_read_configuration_byte(cpu, address) == defaults[index] &&
                   dspic33_read_configuration_byte(cpu, address + 1u) == 0xffu,
               "configuration factory raw bytes");
        expect(state,
               dspic33_read_program_byte(cpu, address) == defaults[index] &&
                   dspic33_read_program_byte(cpu, address + 1u) == 0u,
               "configuration factory CPU bytes");
        expect(state,
               read_table(cpu, address, TBLRDL_W2_W3, &value) &&
                   value == defaults[index],
               "configuration factory TBLRDL");
        expect(state, read_table(cpu, address, TBLRDH_W2_W3, &value) && value == 0u,
               "configuration factory TBLRDH");
    }

    for (index = 0u; index < sizeof(addresses) / sizeof(addresses[0]); index++) {
        uint32_t address = addresses[index];
        expect(state, dspic33_load_configuration_word(cpu, address, loaded[index]),
               "load raw configuration pair");
        expect(state,
               dspic33_read_configuration_byte(cpu, address) ==
                       (uint8_t)loaded[index] &&
                   dspic33_read_configuration_byte(cpu, address + 1u) ==
                       (uint8_t)(loaded[index] >> 8u),
               "raw configuration API preserves pair");
        expect(state,
               dspic33_read_program_byte(cpu, address) == (uint8_t)loaded[index] &&
                   dspic33_read_program_byte(cpu, address + 1u) == 0u,
               "CPU configuration view zero extends low byte");
        expect(state,
               read_table(cpu, address, TBLRDL_W2_W3, &value) &&
                   value == (uint8_t)loaded[index],
               "loaded configuration TBLRDL");
        expect(state, read_table(cpu, address, TBLRDH_W2_W3, &value) && value == 0u,
               "loaded configuration TBLRDH");
    }

    expect(state,
           read_table(cpu, addresses[0], TBLRDL_BYTE_W2_W3, &value) && value == 0xa511u,
           "configuration TBLRDL low byte");
    expect(state,
           read_table(cpu, addresses[0] + 1u, TBLRDL_BYTE_W2_W3, &value) &&
               value == 0xa500u,
           "configuration TBLRDL upper byte zero");
    expect(state,
           read_table(cpu, addresses[0], TBLRDH_BYTE_W2_W3, &value) && value == 0xa500u,
           "configuration TBLRDH low byte zero");
    expect(state,
           read_table(cpu, addresses[0] + 1u, TBLRDH_BYTE_W2_W3, &value) &&
               value == 0xa500u,
           "configuration TBLRDH upper byte zero");

    for (index = 0u; index < sizeof(ids) / sizeof(ids[0]); index++) {
        uint32_t address = ids[index];
        uint16_t expected = id_values[index];
        expect(state,
               read_table(cpu, address, TBLRDL_W2_W3, &value) && value == expected,
               "device ID TBLRDL");
        expect(state, read_table(cpu, address, TBLRDH_W2_W3, &value) && value == 0u,
               "device ID TBLRDH");
        expect(state,
               read_table(cpu, address, TBLRDL_BYTE_W2_W3, &value) &&
                   value == (uint16_t)(0xa500u | (uint8_t)expected),
               "device ID TBLRDL low byte");
        expect(state,
               read_table(cpu, address + 1u, TBLRDL_BYTE_W2_W3, &value) &&
                   value == (uint16_t)(0xa500u | (uint8_t)(expected >> 8u)),
               "device ID TBLRDL upper byte");
        expect(state,
               read_table(cpu, address, TBLRDH_BYTE_W2_W3, &value) && value == 0xa500u,
               "device ID TBLRDH low byte zero");
        expect(state,
               read_table(cpu, address + 1u, TBLRDH_BYTE_W2_W3, &value) &&
                   value == 0xa500u,
               "device ID TBLRDH upper byte zero");
        expect(state,
               dspic33_read_program_byte(cpu, address) == (uint8_t)expected &&
                   dspic33_read_program_byte(cpu, address + 1u) ==
                       (uint8_t)(expected >> 8u),
               "device ID host program bytes");
    }

    for (index = 0u; index < sizeof(reserved) / sizeof(reserved[0]); index++) {
        uint32_t address = reserved[index];
        expect(state, read_table(cpu, address, TBLRDL_W2_W3, &value) && value == 0u,
               "reserved configuration TBLRDL zero");
        expect(state, read_table(cpu, address, TBLRDH_W2_W3, &value) && value == 0u,
               "reserved configuration TBLRDH zero");
        expect(state,
               dspic33_read_program_byte(cpu, address) == 0u &&
                   dspic33_read_program_byte(cpu, address + 1u) == 0u,
               "reserved configuration host bytes zero");
    }

    copy_initialized = dspic33_initialize(&copy);
    expect(state, copy_initialized, "initialize configuration copy");
    if (copy_initialized) {
        expect(state, dspic33_copy(&copy, cpu), "copy configuration state");
        expect(state,
               dspic33_read_configuration_byte(&copy, addresses[0]) ==
                       (uint8_t)loaded[0] &&
                   dspic33_read_configuration_byte(&copy, addresses[0] + 1u) ==
                       (uint8_t)(loaded[0] >> 8u),
               "copy preserves raw configuration pair");
        expect(state,
               read_table(&copy, addresses[0], TBLRDL_W2_W3, &value) &&
                   value == (uint8_t)loaded[0],
               "copy preserves CPU configuration view");
        dspic33_destroy(&copy);
    }
}

static void load_start_sequence(Dspic33* cpu, bool delayed_write) {
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE, MOVE_KEY_55);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 2u, WRITE_NVM_KEY);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 4u, MOVE_KEY_AA);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 6u, WRITE_NVM_KEY);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 8u,
                              delayed_write ? 0x000000u : SET_NVM_WRITE);
    dspic33_load_program_word(cpu, NVM_SEQUENCE_BASE + 10u, SET_NVM_WRITE);
    cpu->pc = NVM_SEQUENCE_BASE;
}

static bool execute_start_sequence(Dspic33* cpu, bool delayed_write) {
    load_start_sequence(cpu, delayed_write);
    return step_instructions(cpu, delayed_write ? 6u : 5u);
}

