tylertms/dspic33e-sim/conformance/nvm.c
static void stall_and_interrupt_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x0032u, 0x000100u);
    dspic33_load_program_word(cpu, 0x0100u, 0x000000u);
    dspic33_write_word(cpu, 0x0820u, 0x8000u);
    dspic33_write_word(cpu, 0x0846u, 0x3000u);
    expect(state, start_operation(cpu, 1u, 0x3200u), "stall operation starts");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "completion stall cycle advances");
    expect(state, !cpu->nvm.active && interrupt_flag(cpu),
           "completion ends stall and raises NVMIF");
    expect(state,
           cpu->pc == NVM_SEQUENCE_BASE + 10u && cpu->instructions == 5u &&
               cpu->interrupt_count == 0u,
           "completion cycle defers interrupt service");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "post-completion instruction advances");
    expect(state, cpu->last_interrupt == NVM_IRQ && cpu->interrupt_count == 1u,
           "NVM interrupt serviced after stall");
    expect(state, cpu->pc == 0x0102u && cpu->instructions == 6u,
           "NVM vector instruction executes after service");
}

static void async_suppression_cases(NvmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    expect(state, start_operation(cpu, 1u, 0x3a00u),
           "suppressed-events operation starts");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "suppressed-events completion cycle");
    expect(state, !cpu->nvm.active && cpu->events.count == 0u,
           "suppressed-events completion removes NVM event");
    expect(state, interrupt_flag(cpu), "suppressed-events completion raises NVMIF");

    dspic33_reset(cpu, 0u);
    expect(state, start_operation(cpu, 1u, 0x3c00u), "disable-during operation starts");
    expect(state, dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 1u, 0u, 5u),
           "queue unrelated event during NVM");
    dspic33_set_async_events(cpu, false);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "disabled-during completion cycle");
    expect(state, !cpu->nvm.active && cpu->events.count == 1u,
           "disabled-during keeps unrelated event only");
    dspic33_write_word(cpu, 0x0800u, 0u);
    dspic33_set_async_events(cpu, true);
    expect(state, dspic33_device_advance(cpu, 5u), "advance retained unrelated event");
    expect(state, (dspic33_read_word(cpu, 0x0800u) & 0x0002u) != 0u,
           "retained unrelated event dispatched");
    expect(state, (dspic33_read_word(cpu, 0x0800u) & 0x8000u) == 0u,
           "stale NVM event does not redispatch");

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    expect(state, start_operation(cpu, 1u, 0x3e00u), "reenabled operation starts");
    dspic33_set_async_events(cpu, true);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "reenabled operation completion cycle");
    expect(state, !cpu->nvm.active && cpu->events.count == 0u,
           "reenabled operation completes without stale event");
}

static void reset_copy_and_failure_cases(NvmConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized;
    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x3400u, 0x00ffffffu);
    cpu->write_latches[0] = 0x00112233u;
    expect(state, start_operation(cpu, 1u, 0x3400u), "reset-abort operation starts");
    dspic33_reset(cpu, 0u);
    expect(state, !cpu->nvm.active && cpu->events.count == 0u,
           "POR aborts operation and event");
    expect(state, dspic33_read_word(cpu, NVM_CONTROL) == 0u, "POR clears WR and WRERR");
    expect(state, program_word(cpu, 0x3400u) == 0x00ffffffu,
           "POR-aborted operation does not program");
    expect(state, cpu->write_latches[0] == 0x00ffffffu, "POR resets write latches");

    initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize NVM copy");
    if (initialized) {
        dspic33_reset(cpu, 0u);
        dspic33_load_program_word(cpu, 0x3600u, 0x00ffffffu);
        cpu->write_latches[0] = 0x00010203u;
        cpu->write_latches[1] = 0x00040506u;
        expect(state, start_operation(cpu, 1u, 0x3600u), "copy operation starts");
        expect(state, dspic33_copy(&copy, cpu), "copy active NVM state");
        expect(state, copy.nvm.active && copy.events.count == 1u,
               "copy retains active event");
        expect(state,
               copy.nvm.address == cpu->nvm.address &&
                   copy.nvm.latches[1] == cpu->nvm.latches[1],
               "copy retains captured operation");
        expect(state, finish_operation(&copy), "copied operation completes");
        expect(state,
               program_word(&copy, 0x3600u) == 0x00010203u &&
                   program_word(&copy, 0x3602u) == 0x00040506u,
               "copied event programs captured pair");
        expect(state, cpu->nvm.active && program_word(cpu, 0x3600u) == 0x00ffffffu,
               "source operation remains independent");
        dspic33_destroy(&copy);
    }

    dspic33_reset(cpu, 0u);
    configure_operation(cpu, 1u, 0x3800u, true);
    cpu->cycles = 1u;
    cpu->device_cycles = UINT64_MAX;
    cpu->instructions = 1u;
    cpu->nvm.key_stage = 2u;
    cpu->nvm.key_instruction = 0u;
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ENABLE | NVM_WRITE | 1u);
    expect(state, !cpu->nvm.active, "event overflow cancels operation");
    expect(state, cpu->events.count == 0u, "event overflow queues no completion");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE) == 0u,
           "event overflow clears WR");
    expect(state, (dspic33_read_word(cpu, NVM_CONTROL) & NVM_WRITE_ERROR) != 0u,
           "event overflow sets WRERR");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, NVM_CONTROL, NVM_WRITE_ENABLE | NVM_WRITE_ERROR | 2u);
    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "software reset executes");
    expect(state, cpu->software_reset_count == 1u, "software reset counted");
    expect(state,
           dspic33_read_word(cpu, NVM_CONTROL) ==
               (NVM_WRITE_ENABLE | NVM_WRITE_ERROR | 2u),
           "warm reset preserves NVMCON POR-only fields");
}

static void doze_stall_cases(NvmConformance* state, Dspic33* cpu) {
    uint64_t cpu_cycles;
    uint64_t device_cycles;

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, MAIN_CLOCK_DIVISOR, 0x3800u);
    dspic33_load_program_word(cpu, 0x3a00u, 0x00ffffffu);
    dspic33_load_program_word(cpu, 0x3a02u, 0x00ffffffu);
    cpu->write_latches[0] = 0x00123456u;
    cpu->write_latches[1] = 0x00654321u;
    expect(state, start_operation(cpu, 1u, 0x3a00u),
           "DOZE NVM operation remains active after WR instruction");
    expect(state,
           cpu->nvm.completion_cycle == cpu->cycles + 1u && cpu->events.count == 1u &&
               cpu->events.items[0].cycle - cpu->device_cycles == 8u &&
               program_word(cpu, 0x3a00u) == 0x00ffffffu && !interrupt_flag(cpu),
           "DOZE NVM event cannot complete before the CPU deadline");
    cpu_cycles = cpu->cycles;
    device_cycles = cpu->device_cycles;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && !cpu->nvm.active &&
               cpu->cycles - cpu_cycles == 1u &&
               cpu->device_cycles - device_cycles == 8u &&
               program_word(cpu, 0x3a00u) == 0x00123456u &&
               program_word(cpu, 0x3a02u) == 0x00654321u && interrupt_flag(cpu),
           "DOZE NVM stall advances both domains and completes at the CPU deadline");
}

static void persistent_program_alias_cases(NvmConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    uint32_t index;
    bool copy_initialized;

    dspic33_reset(cpu, 0u);
    expect(state,
           program_word(cpu, PERSISTENT_PROGRAM_BASE) == 0x00ffffffu &&
               program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE) ==
                   0x00ffffffu,
           "persistent physical and tagged views reset erased");
    expect(state,
           dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_BASE, 0x00112233u) &&
               program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE) ==
                   0x00112233u &&
               dspic33_load_program_word(
                   cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE + 2u,
                   0x00445566u) &&
               program_word(cpu, PERSISTENT_PROGRAM_BASE + 2u) == 0x00445566u,
           "persistent loader keeps physical and tagged views coherent");

    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_BASE - 2u, 0x00010203u);
    dspic33_load_program_word(
        cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE - 2u, 0x00654321u);
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_BASE, 0x00ffffffu);
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_BASE + 2u, 0x00ffffffu);
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_BASE + 4u, 0x00040506u);
    cpu->write_latches[0] = 0x00123456u;
    cpu->write_latches[1] = 0x00654321u;
    expect(state,
           start_operation(cpu, 1u, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE),
           "persistent pair operation starts");
    expect(state, cpu->nvm.address == PERSISTENT_PROGRAM_BASE,
           "persistent pair request normalizes through NVMADRU");
    expect(state, finish_operation(cpu), "persistent pair operation completes");
    expect(state,
           program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE) ==
                   0x00123456u &&
               program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE +
                                     2u) == 0x00654321u,
           "persistent pair updates tagged firmware view");
    expect(state,
           program_word(cpu, PERSISTENT_PROGRAM_BASE - 2u) == 0x00010203u &&
               program_word(cpu, PERSISTENT_PROGRAM_BASE + 4u) == 0x00040506u,
           "persistent pair preserves adjacent physical words");
    expect(state,
           program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE - 2u) ==
               0x00654321u,
           "persistent lower boundary keeps physical and tagged storage separate");

    dspic33_reset(cpu, 0u);
    for (index = 0u; index < DSPIC33_WRITE_LATCH_WORDS; index++) {
        cpu->write_latches[index] = 0x00330000u | index;
    }
    dspic33_load_program_word(cpu, 0x22feu, 0x00010203u);
    dspic33_load_program_word(cpu, 0x2300u, 0x00ffffffu);
    dspic33_load_program_word(cpu, 0x23feu, 0x00ffffffu);
    dspic33_load_program_word(cpu, 0x2400u, 0x00040506u);
    expect(state, start_operation(cpu, 2u, PERSISTENT_PROGRAM_TAG + 0x23feu),
           "persistent row operation starts");
    expect(state, cpu->nvm.address == 0x23feu,
           "persistent row request normalizes through NVMADRU");
    expect(state, finish_operation(cpu), "persistent row operation completes");
    expect(state,
           program_word(cpu, PERSISTENT_PROGRAM_TAG + 0x2300u) == 0x00330000u &&
               program_word(cpu, PERSISTENT_PROGRAM_TAG + 0x23feu) == 0x0033007fu,
           "persistent row updates exact tagged range");
    expect(state,
           program_word(cpu, 0x22feu) == 0x00010203u &&
               program_word(cpu, 0x2400u) == 0x00040506u,
           "persistent row preserves adjacent words");

    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x27feu, 0x00010203u);
    dspic33_load_program_word(cpu, 0x2800u, 0u);
    dspic33_load_program_word(cpu, 0x2ffeu, 0u);
    dspic33_load_program_word(cpu, 0x3000u, 0x00040506u);
    expect(state, start_operation(cpu, 3u, PERSISTENT_PROGRAM_TAG + 0x2ffeu),
           "persistent page operation starts");
    expect(state, cpu->nvm.address == 0x2ffeu,
           "persistent page request normalizes through NVMADRU");
    expect(state, finish_operation(cpu), "persistent page operation completes");
    expect(state,
           program_word(cpu, PERSISTENT_PROGRAM_TAG + 0x2800u) == 0x00ffffffu &&
               program_word(cpu, PERSISTENT_PROGRAM_TAG + 0x2ffeu) == 0x00ffffffu,
           "persistent page erase updates tagged view");
    expect(state,
           program_word(cpu, 0x27feu) == 0x00010203u &&
               program_word(cpu, 0x3000u) == 0x00040506u,
           "persistent page erase preserves adjacent words");

    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x4800u, 0u);
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_LIMIT - 2u, 0u);
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_LIMIT, 0x00010203u);
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_LIMIT,
                              0x00040506u);
    expect(state,
           start_operation(cpu, 3u,
                           PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_LIMIT - 2u),
           "persistent upper page operation starts");
    expect(state, cpu->nvm.address == PERSISTENT_PROGRAM_LIMIT - 2u,
           "persistent upper page normalizes through NVMADRU");
    expect(state, finish_operation(cpu), "persistent upper page operation completes");
    expect(state,
           program_word(cpu, PERSISTENT_PROGRAM_TAG + 0x4800u) == 0x00ffffffu &&
               program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_LIMIT -
                                     2u) == 0x00ffffffu,
           "persistent upper page erases through physical limit");
    expect(state,
           program_word(cpu, PERSISTENT_PROGRAM_LIMIT) == 0x00010203u &&
               program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_LIMIT) ==
                   0x00040506u,
           "program origin and tagged boundary remain independently routed");

    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_BASE, 0u);
    dspic33_load_program_word(cpu, DSPIC33_AUXILIARY_PROGRAM_BASE, 0x00010203u);
    dspic33_load_configuration_word(cpu, DSPIC33_CONFIGURATION_BASE + 4u, 0xff30u);
    expect(state, start_operation(cpu, 0x0du, 0u),
           "general bulk erase with persistent data starts");
    expect(state, finish_operation(cpu),
           "general bulk erase with persistent data completes");
    expect(state,
           program_word(cpu, PERSISTENT_PROGRAM_BASE) == 0x00ffffffu &&
               program_word(cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE) ==
                   0x00ffffffu &&
               dspic33_read_configuration_byte(cpu, DSPIC33_CONFIGURATION_BASE + 4u) ==
                   0xcfu,
           "general bulk erase clears persistent data and FGS");
    expect(state, program_word(cpu, DSPIC33_AUXILIARY_PROGRAM_BASE) == 0x00010203u,
           "general bulk erase preserves auxiliary program");

    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_BASE + 0x200u, 0x00112233u);
    copy_initialized = dspic33_initialize(&copy);
    expect(state, copy_initialized, "initialize persistent alias copy");
    if (copy_initialized) {
        expect(state, dspic33_copy(&copy, cpu), "copy persistent alias state");
        dspic33_load_program_word(
            cpu, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE + 0x200u,
            0x00445566u);
        expect(state,
               program_word(cpu, PERSISTENT_PROGRAM_BASE + 0x200u) == 0x00445566u &&
                   program_word(&copy, PERSISTENT_PROGRAM_BASE + 0x200u) == 0x00112233u,
               "copied persistent aliases diverge independently");
        dspic33_destroy(&copy);
    }

